system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

c	  8.7998;	// mm
h	  16.4207;	// mm
l	  95.0;		// mm

vertices
(
	(0 0 0)
	(0 $h #calc "-0.5 * $c")
	(0 $h #calc "0.5 * $c")
	($l 0 0)
	($l $h #calc "-0.5 * $c")
	($l $h #calc "0.5 * $c")
);

blocks
(
	hex (0 3 4 1 2 5 5 2) (300 60 20) simpleGrading (1 1 1) // axi-symmetric block
);

edges
(
	arc 1 2 (0 17 0)	// inlet arc
	arc 4 5 (95 17 0)	// outlet arc
);

boundary
(
	inletO2
	{
		type patch;
		faces
		(
			(0 1 2 2)	// oxidiser
		);
	}
	inletC2H4
	{
		type patch;
		faces
		(
			(1 4 5 2)	// fuel
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(3 4 5 5)	// chamber exit
		);
	};
	front
	{
		type wedge;
		faces
		(
			(0 2 5 3)	// front wedge
		);
	}
	back
	{
		type wedge;
		faces
		(
			(0 1 4 3)	// back wedge
		);
	}
);

// mergePatchPairs
