constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inletO2
    {
        type            patch;
        nFaces          1200;
        startFace       1054800;
    }
    inletC2H4
    {
        type            patch;
        nFaces          6000;
        startFace       1056000;
    }
    outlet
    {
        type            patch;
        nFaces          1200;
        startFace       1062000;
    }
    front
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          6000;
        startFace       1063200;
    }
    back
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          18000;
        startFace       1069200;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       1087200;
    }
)

// ************************************************************************* //
