constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/solvers/chemistry/TDAC/chemistryProperties.cfg"

chemistry       off;                // Turn off detailed chemistry calculations
chemistryType
{
    solver      none;               // No solver for chemical kinetics
}

mixtureModel
{
    type        singleStep;         // Use a simplified model for instantaneous reactions
    fuel        C2H4;               // Specify the fuel species
    oxidizer    N2O;                // Specify the oxidizer species
    stoichiometry
    {
        C2H4 1;                     // Stoichiometric coefficient for fuel
        N2O 3;                      // Stoichiometric coefficient for oxidizer
    }
}

heatReleaseModel sensibleEnthalpy;  // Calculate heat release based on sensible enthalpy

#include "reactionsGRI"

// ************************************************************************* //
